tap "homebrew/cask"
cask_args appdir: "~/Applications"
tap "homebrew/cask-drivers"

brew "mas"

brew "hblock"
brew "ykman"
brew "hugo"
brew "openapi-generator"
brew "oq"
brew "jo"
brew "bitwarden-cli"
brew "step"

cask "brave-browser"
cask "firefox"
cask "iterm2"
cask "ripcord"
cask "signal"
cask "sublime-text"
cask "yubico-authenticator"
cask "thinkorswim"
cask "spotify"
cask "balenaetcher"

# Shell Tools
brew "fish"
brew "tmux"
brew "tree"
brew "bfg"

# Rust dev
brew "rustup"
cask "clion"

# K8s dev
tap "int128/kubelogin"

cask "docker"
brew "helm@3"
brew "kubectl"
brew "wget"
brew "skaffold"
brew "int128/kubelogin/kubelogin"
brew "kustomize"
brew "kubeseal"
brew "argocd"
brew "linkerd"
brew "k3d"
brew "docker-compose"

# Android dev
brew "openjdk@17"
cask "android-studio"

# Haskell dev
brew "haskell-stack"
brew "haskell-language-server"

# Golang
brew "go"
brew "protoc-gen-go"

# Games
brew "unshield"
