# vim: syntax=ruby
tap "homebrew/cask"
cask_args appdir: "~/Applications"
tap "homebrew/cask-drivers"

brew "mas"

brew "hblock"
brew "ykman"
brew "hugo"
brew "openapi-generator"
brew "oq"
brew "jo"
brew "bitwarden-cli"
brew "step"
brew "ripgrep", args: ["build-from-source"]
brew "exa", args: ["build-from-source"]
brew "sl", args: ["build-from-source"]
brew "pandoc"
brew "cmake"
brew "qt5"
brew "libusb"

cask "brave-browser"
cask "firefox"
cask "iterm2"
cask "ripcord"
cask "signal"
cask "sublime-text"
cask "yubico-authenticator"
cask "thinkorswim"
cask "spotify"
cask "balenaetcher"
cask "obsidian"
cask "wkhtmltopdf"

# Shell Tools
brew "fish"
brew "tmux"
brew "tree"
brew "bfg"

# Rust dev
brew "rustup"
cask "clion"
brew "rust-analyzer"

# K8s dev
tap "int128/kubelogin"

cask "docker"
brew "helm@3"
brew "kubectl"
brew "wget"
brew "skaffold"
brew "int128/kubelogin/kubelogin"
brew "kustomize"
brew "kubeseal"
brew "argocd"
brew "linkerd"
brew "k3d"
brew "docker-compose"
brew "earthly/earthly/earthly"
brew "helmfile"

# Android dev
brew "openjdk@18"
cask "android-studio"
cask "flutter"

# Haskell dev
brew "haskell-stack"
brew "haskell-language-server"

# Golang
brew "go"
brew "protoc-gen-go"

# Games
brew "unshield"

# Misc Dev
tap "helix-editor/helix"
brew "helix"

tap "danielgtaylor/restish"
brew "restish"

# Python dev
brew "python@3.10"
brew "poetry"

# OCaml dev
brew "opam"
