tap "homebrew/cask"
cask_args appdir: "~/Applications", require_sha: true

brew "hblock"
brew "ykman"

cask "firefox"
cask "iterm2"
cask "ripcord"
cask "sublime-text"

# Shell Tools
brew "fish"
brew "tmux"
brew "tree"

# Rust dev
brew "rustup"
cask "clion"

# K8s dev
tap "int128/kubelogin"

cask "docker"
brew "helm@3"
brew "kubectl"
brew "wget"
brew "oq"
brew "skaffold"
brew "k3d"
brew "int128/kubelogin/kubelogin"
brew "kustomize"
brew "kubeseal"
brew "argocd"

# Android dev
brew "openjdk@17"
cask "android-studio"

# Haskell dev
brew "haskell-stack"
brew "haskell-language-server"

# Golang
brew "go"
